Revit.Elements.ElementType
A Revit ElementType

Revit.Elements.ElementType.InternalElementType
An internal reference to the ElementType.

Revit.Elements.ElementType.InternalElement
Reference to the Element.

Revit.Elements.ElementType.#ctor(Autodesk.Revit.DB.ElementType)
Protected constructor for the Element.
elementType:

Revit.Elements.ElementType.InitElementType(Autodesk.Revit.DB.ElementType)
Initialize a ElementType element
and sets the ElementType property, element id, and unique id.
elementType:

Revit.Elements.ElementType.Name
The name of the ElementType.

Revit.Elements.ElementType.FamilyName
The FamilyName of the ElementType.

Revit.Elements.ElementType.CanBeDeleted
Determine if this ElementType can be deleted.

Revit.Elements.ElementType.CanBeCopied
Determine if this ElementType can be copied.

Revit.Elements.ElementType.CanBeRenamed
Determine if this ElementType can be renamed.

Revit.Elements.ElementType.Duplicate(System.String)
Duplicates an existing element type and assigns it a new name.
name: The new name of the element type.
Returns: The duplicated element type.

Revit.Elements.ElementType.ByName(System.String)
Returns the type Element with the given name.
name: Name of the type
Returns: Type Element

Revit.Elements.ElementType.FromExisting(Autodesk.Revit.DB.ElementType,System.Boolean)
Create a ElementType from a user selected Element.
elementType:
isRevitOwned:
Returns:

Revit.Elements.ElementType.GetPreviewImage(System.Int32)
Get the preview image of an element. This image is similar to what is seen in
the Revit UI when selecting the type of an element.
size: The width and height of the preview image in pixels.
Returns: The preview image. null if there is no preview image.